START_TEXT = 'Вас приветствует внутренний бот сети Mr. Capuccin!\nДля открытия смены нажмите /start_work'

WRONG_USER_TEXT = 'Данный бот предназначен для сотрудников внутри сети.'

START_WORK_TEXT = 'Доброе утро, {}!\nВыберите торговую точку:'
SELECT_STORE_TEXT = 'Вы выбрали торговую точку <b>{}</b>.\nВы уверены, что хотите начать смену?'

CHANGE_TASKS_TEXT = 'Следующие задачи Вам нужно выполнить до {}'
OPEN_WORK_SESSION_TEXT = 'Мы рады приветствовать Вас на смене. Надеемся что она пройдёт легко и беззаботно.' \
                         '\n\n' + CHANGE_TASKS_TEXT

CONFIRMATION_TEXT = 'Для этой задачи требуется фото подтверждение.\nОтправьте пожалуйста фото:'
NOT_UNIQUE_PHOTO_TEXT = 'Это фото уже отправлялось, как подтверждение.\nОтправьте актуальное фото:'
PHOTO_CONFIRMATION_OK = 'Спасибо за подтверждение.'

OPEN_SESSION_FILTER_TEXT = 'У вас уже открыта рабочая смена.'

OUT_OF_TIME_TEXT = 'К сожалению, вы не успели выполнить эту задачу вовремя 🤷.'

CLOSE_WORK_SESSION_TEXT = 'Ваша смена закончена. Спасибо за работу!'

CHANGING_CONFIRM_TXT = 'Вы уверены, что хотите смениться?'
CHANGING_ASK_ID_TEXT = 'Введите ID человека, который Вас подменяет.\nID можно посмотреть в разделе /info:'
WRONG_ID_TEXT = 'Неверный ID. Попробуйте ещё раз:'
CHANGING_NO_WORKER_TEXT = 'Сотрудник не найден. Попробуйте ещё раз:'
CHANGE_USER_BUSY_TEXT = '{} сегодня занят в другом месте. Введите ID другого пользователя.'
CHANGE_USER_OK_TEXT = 'Вы успешно передали смену.\nСпасибо за работу.'
CHANGING_NEW_WORKER_TEXT = '{} передал Вам смену.\nВаши текущие задачи:'
